{"keras_version": "2.0.8", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [2, 2], "data_format": "channels_last", "name": "conv1", "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [7, 7], "trainable": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "maxpool1", "class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "maxpool1"}}, {"inbound_nodes": [[["maxpool1", 0, 0, {}]]], "name": "fire2/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire2/squeeze1x1", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire2/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire2/expand1x1", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire2/expand3x3", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire2/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire2/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "name": "fire2/concat", "class_name": "Concatenate", "config": {"name": "fire2/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "fire3/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire3/squeeze1x1", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "name": "fire3/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire3/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire3/expand1x1", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire3/expand3x3", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "name": "fire3/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire3/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "name": "fire3/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire3/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "name": "fire3/concat", "class_name": "Concatenate", "config": {"name": "fire3/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "name": "fire4/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire4/squeeze1x1", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire4/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire4/expand1x1", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire4/expand3x3", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire4/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire4/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "name": "fire4/concat", "class_name": "Concatenate", "config": {"name": "fire4/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "maxpool2", "class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "maxpool2"}}, {"inbound_nodes": [[["maxpool2", 0, 0, {}]]], "name": "fire5/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire5/squeeze1x1", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "name": "fire5/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire5/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire5/expand1x1", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire5/expand3x3", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "name": "fire5/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire5/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "name": "fire5/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire5/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "name": "fire5/concat", "class_name": "Concatenate", "config": {"name": "fire5/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "name": "fire6/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire6/squeeze1x1", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "name": "fire6/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire6/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire6/expand1x1", "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire6/expand3x3", "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "name": "fire6/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire6/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "name": "fire6/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire6/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "name": "fire6/concat", "class_name": "Concatenate", "config": {"name": "fire6/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "name": "fire7/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire7/squeeze1x1", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "name": "fire7/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire7/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire7/expand1x1", "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire7/expand3x3", "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "name": "fire7/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire7/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "name": "fire7/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire7/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "name": "fire7/concat", "class_name": "Concatenate", "config": {"name": "fire7/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "name": "fire8/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire8/squeeze1x1", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "name": "fire8/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire8/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire8/expand1x1", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire8/expand3x3", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "name": "fire8/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire8/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "name": "fire8/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire8/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "name": "fire8/concat", "class_name": "Concatenate", "config": {"name": "fire8/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "name": "maxpool3", "class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "maxpool3"}}, {"inbound_nodes": [[["maxpool3", 0, 0, {}]]], "name": "fire9/squeeze1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire9/squeeze1x1", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "name": "fire9/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire9/relu_squeeze1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand1x1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire9/expand1x1", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand3x3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "fire9/expand3x3", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "name": "fire9/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire9/relu_expand1x1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "name": "fire9/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire9/relu_expand3x3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "name": "fire9/concat", "class_name": "Concatenate", "config": {"name": "fire9/concat", "trainable": true, "axis": 3}}, {"inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "name": "drop9", "class_name": "Dropout", "config": {"name": "drop9", "rate": 0.5, "trainable": true}}, {"inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10", "class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "conv10", "filters": 43, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv10", 0, 0, {}]]], "name": "avgpool10", "class_name": "GlobalAveragePooling2D", "config": {"name": "avgpool10", "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["avgpool10", 0, 0, {}]]], "name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "activation": "softmax"}}], "output_layers": [["softmax", 0, 0]]}, "backend": "tensorflow"}